In [35]:
import numpy as np
import pandas as pd

In [36]:
import os

In [37]:
data=pd.read_excel('Encodings-1.xlsx')

In [38]:
data

     Name  Gender  Age
0     Ram    Male   29
1    Sita  Female   21
2   Shubh    Male   30
3  Amruta  Female   26

In [39]:
# now if we want to find out the encoding then we can apply one hot encodoing because the data is nominal

In [40]:
# we can use the pandas get dummies method for that
pd.get_dummies(data['Gender'])

   Female  Male
0       0     1
1       1     0
2       0     1
3       1     0

In [41]:
# but here as we can see we have 2 dummy variables, and as per the dummy variables trap if we will have the same no. of
# dummy variables as the number of variables we want to encode then it will create the dummy variable trap
# to tackle that we need to have n-1 no.of dummy variables which is 1 here as the n is 2 as male and female

In [42]:
# so
pd.get_dummies(data['Gender'],drop_first=True) # which is by default false
# and it will delete the first dummy variable for us

   Male
0     1
1     0
2     1
3     0

In [43]:
# we can also assign the same to the existing dataframe for our execution
data['sex']=pd.get_dummies(data['Gender'],drop_first=True)

In [44]:
# now we can see a sex column added to the existing dataframe
data

     Name  Gender  Age  sex
0     Ram    Male   29    1
1    Sita  Female   21    0
2   Shubh    Male   30    1
3  Amruta  Female   26    0

In [45]:
# now let's discuss about Label encoding

In [57]:
data2=pd.read_excel('Encodings-2.xlsx')

In [58]:
data2

     Name Education
0     Ram      12th
1    Sita        BE
2   Shubh       PHD
3  Amruta   Masters

In [59]:
# here we can see in the education column we have 4 types of education, so based on the we can rank the respective individual

In [60]:
# so for that we can able to use the Label encoding

In [61]:
#so
from sklearn.preprocessing import LabelEncoder

In [62]:
encoder=LabelEncoder()

In [63]:
data2['Educationrank']=encoder.fit_transform(data2['Education'])

In [64]:
data2

     Name Education  Educationrank
0     Ram      12th              0
1    Sita        BE              1
2   Shubh       PHD              3
3  Amruta   Masters              2

In [56]:
# As we can see the PHD has been given with the highest ranking weight as 3 and masters as 2 and so on

In [65]:
# There is also one more method called One hot encoding in multiple categories, describe about it the theory only...
# we will be using this technique in the respective machine learning model

In [66]:
# Target guided ordinal encoding

In [68]:
# here we take the occurances of the specific categorical data with the output
# For example let's say if A is present 5 times and the y value for each A is 1,2,3,4,5
# Then we can take the average of the all occurances of A and based on the mean found out in all the 
# categories we sort them from high to low, then rank them

In [67]:
data3=pd.read_excel('Encodings-3.xlsx')

In [69]:
data3

     Name Education  Salary
0     Ram      12th   10000
1    Sita        BE   25000
2   Shubh       PHD  100000
3  Amruta   Masters   50000
4   Jofra      12th   12000
5  Alfred        BE   30000
6    Mina       PHD  115000
7    Anne   Masters   70000

In [71]:
# here Name and Education are dependent and Salary is independent variable

In [70]:
# As we can see we have 12th, BE,PHD and Masters present 2 times, so we can take the mean of salary for them as Salary is the 
# independent variable

In [81]:
import category_encoders as ce

In [82]:
encode3=ce.TargetEncoder(cols=['Education'])

In [84]:
data3['Target']=encode3.fit_transform(data3['Education'],data3['Salary'])

D:\Anaconda3.8\lib\site-packages\category_encoders\utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

In [85]:
# Now if we will check the data3 then
data3

     Name Education  Salary        Target
0     Ram      12th   10000  21892.127565
1    Sita        BE   25000  33954.594113
2   Shubh       PHD  100000  92439.280403
3  Amruta   Masters   50000  57713.997918
4   Jofra      12th   12000  21892.127565
5  Alfred        BE   30000  33954.594113
6    Mina       PHD  115000  92439.280403
7    Anne   Masters   70000  57713.997918

In [86]:
# We can see the Target weight is highest for PHD and then Masters and so on

In [87]:
# we can also use label binarizer for binary label encoding if we have 2 categorical data

In [88]:
from sklearn.preprocessing import LabelBinarizer

In [91]:
data

     Name  Gender  Age  sex
0     Ram    Male   29    1
1    Sita  Female   21    0
2   Shubh    Male   30    1
3  Amruta  Female   26    0

In [93]:
data=data.drop('sex',axis=1)

In [94]:
# we can apply Label binarizer to Grnder here

le=LabelBinarizer()

In [96]:
data['sex']=le.fit_transform(data['Gender'])

In [97]:
data

     Name  Gender  Age  sex
0     Ram    Male   29    1
1    Sita  Female   21    0
2   Shubh    Male   30    1
3  Amruta  Female   26    0